# Python For Data Analysis - Chapter 5 (Pandas)

In [27]:
import numpy as np
import pandas as pd
# Series and DataFrame are heavily used so you may import them directly
from pandas import Series, DataFrame

## 5.1 Introduction to pandas Data Structures

Series, DataFrame.

### Series

In [6]:
ser = Series([4,7,-5,3])
ser

0    4
1    7
2   -5
3    3
dtype: int64

In [9]:
ser.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
ser.values

array([ 4,  7, -5,  3])

In [17]:
# we can create Series with custom index
# note that the length of the index must be the same as number of values
# otherwise you'll get an error
custom_idx = Series([4,7,-5,3], index=['d','b','a','c'])
custom_idx

d    4
b    7
a   -5
c    3
dtype: int64

In [14]:
custom_idx.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [15]:
custom_idx['a']

-5

In [18]:
# you can also select multiple values by an array of indices
custom_idx[['c','a','d']]

c    3
a   -5
d    4
dtype: int64

#### Series - Use NumPy-like operations

In [22]:
print(custom_idx > 0)
custom_idx[custom_idx > 0]

d     True
b     True
a    False
c     True
dtype: bool

d    4
b    7
c    3
dtype: int64

In [25]:
custom_idx ** 2

d    16
b    49
a    25
c     9
dtype: int64

In [28]:
np.exp(custom_idx)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

#### Using Series as dict

In [31]:
'b' in custom_idx

True

In [32]:
'e' in custom_idx

False

In [125]:
# notice the dict keys are in _sorted_ order
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
states_ser = Series(sdata)
states_ser

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [44]:
# we can override dict keys ordering 
# - notice that 'California' yields NaN and 'Utah' is omitted
states = ['California', 'Ohio', 'Oregon', 'Texas']
states_ser_idx = Series(sdata, index=states)
states_ser_idx

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [46]:
# use isnull and notnull to detect missing/existing data
states_ser_idx.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [47]:
states_ser_idx.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [48]:
states_ser_idx[states_ser_idx.notnull()]

Ohio      35000.0
Oregon    16000.0
Texas     71000.0
dtype: float64

In [49]:
# arithmetic operations work on values matching by index labels
# - it's similar to DB joins
states_ser + states_ser_idx

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [54]:
# Series and its index have 'name' attribute
states_ser_idx.name = 'population'
states_ser_idx.index.name = 'state'
states_ser_idx

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [55]:
# index can be altered
ser.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
ser

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

a rectangular table o data with ordered collection of heterogenous columns.  
Has both row and column index.  
Can be visualized as a **"dict of Series sharing the same index"**.

In [63]:
data = {'state': ['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year': [2000,2001,2002,2001,2002,2003],
        'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}
frame = DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [68]:
# custom columns order
states_pop = DataFrame(data, columns=['year','state','pop'])
states_pop

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [69]:
states_ser

state
Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
Name: population, dtype: int64

In [60]:

myframe = DataFrame(states_ser)
myframe

        population
state
Ohio         35000
Texas        71000
Oregon       16000
Utah          5000

In [70]:
# YOu can retrieve a column in a DataFrame as a Series object
# the result have the same index as the DataFrame
states_pop['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [72]:
# You can add a new column
states_pop['debt'] = np.arange(6.)
states_pop

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

#### creating DataFrame from nested dicts

In [74]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
states_pop_nested = DataFrame(pop)
states_pop_nested

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [75]:
# transposed dataframe
states_pop_nested.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [79]:
# DataFrame's index name and columns name

pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
states_pop_nested = DataFrame(pop)

states_pop_nested.index.name = 'year'
states_pop_nested.columns.name = 'state'
states_pop_nested

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

### Index Objects

In [89]:
states_pop_nested.loc[states_pop_nested.index]

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

state  Nevada  Ohio
2001      2.4   1.7
2002      2.9   3.6

## 5.2 Essential functionality

### reindex

In [96]:

s = Series([10,20,30], ['a','b','c'])
s

a    10
b    20
c    30
dtype: int64

In [98]:
s.reindex(['a','b','d'])

a    10.0
b    20.0
d     NaN
dtype: float64

In [102]:
df = DataFrame(np.arange(9).reshape(3,3), index=['a','c','d'], columns=['Ohio','Texas','California'])
df

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [103]:
df.reindex(columns=['Texas','Utah','California'])

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### drop

In [106]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [108]:
# drop rows
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [110]:
# drop columns 
data.drop(['one', 'three'], axis='columns') # or axis=1

          two  four
Ohio        1     3
Colorado    5     7
Utah        9    11
New York   13    15

### Indexing, Selection, and Filter

In [114]:
# select given values from a Series
obj = Series(np.arange(4.), index=['a','b','c','d'])
obj[['a','d']]

a    0.0
d    3.0
dtype: float64

In [116]:
# select by labels - end is inclusive!!!
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [117]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [120]:
# DataFrame - single element or a list selects columns,
# selection syntax [:2] selects rows!
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [122]:
data['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int64

In [124]:
data[['one', 'three']]

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

#### loc and iloc - label-indexing on rows (p. 143)

In [131]:
# let's select single row and multiple columns first
data.loc['Colorado', ['one', 'four']]

one     4
four    7
Name: Colorado, dtype: int64

In [132]:
# ... compare two rows and columns:
data.loc[['Colorado', 'Ohio'], ['one', 'four']]

          one  four
Colorado    4     7
Ohio        0     3

### Arithmetic and Data Alignment

In [134]:
# + of two series will return NaNs where index don't overlap
s1 = Series([7, -2, 3, 1], index=['a','c','d','e'])
s2 = Series([70, -20, 30, 10, 100], index=['a','c','e','f','g'])
s1 + s2

a    77.0
c   -22.0
d     NaN
e    31.0
f     NaN
g     NaN
dtype: float64

In [137]:
# Use fill_value and add method to specify value instead of NaN
s1 = Series([7, -2, 3, 1], index=['a','c','d','e'])
s2 = Series([70, -20, 30, 10, 100], index=['a','c','e','f','g'])
# instead of: s1 + s2
s1.add(s2, fill_value = 0)

a     77.0
c    -22.0
d      3.0
e     31.0
f     10.0
g    100.0
dtype: float64

In [145]:
# broadcastingB - operations between Series and DataFrame
frame = DataFrame(np.arange(12.).reshape((4,3)), 
                  columns=list('bde'), # thi is the same as ['b','d','e']
                  index=['Utah','Ohio','Texas','Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [146]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [147]:
# by default, the arithmetic matches index of the Series on the DataFrame's columns,
# broadcasting down the rows:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

## 5.3 Summary statistisc

In [4]:
import pandas as pd
from pandas import Series, DataFrame
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})
volume = DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [8]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2015-05-21  121.090179  139.470474   43.035767   542.510010
2015-05-22  122.150032  138.569336   42.563839   540.109985
2015-05-26  119.458923  136.887711   42.282513   532.320007
2015-05-27  121.689232  138.392303   43.208202   539.789978
2015-05-28  121.449577  138.158981   43.062996   539.780029
...                ...         ...         ...          ...
2020-05-12  311.410004  120.260002  182.509995  1375.739990
2020-05-13  307.649994  115.730003  179.750000  1349.329956
2020-05-14  309.540009  116.949997  180.529999  1356.130005
2020-05-15  307.709991  116.980003  183.160004  1373.189941
2020-05-18  314.959991  121.559998  184.910004  1383.939941

[1257 rows x 4 columns]

In [6]:
price.describe()

              AAPL          IBM         MSFT         GOOG
count  1257.000000  1257.000000  1257.000000  1257.000000
mean    162.233297   130.024894    87.896858   974.587617
std      58.277530    11.258019    38.898196   230.892805
min      84.962914    93.515839    36.970531   516.830017
25%     109.479942   125.063774    53.677528   766.809998
50%     154.412857   131.388474    80.615417  1016.530029
75%     196.435623   136.280167   110.892822  1155.810059
max     326.316681   157.394867   188.185989  1526.689941

### Correlation and Covariance

In [8]:
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-05-13 -0.012074 -0.037668 -0.015122 -0.019197
2020-05-14  0.006143  0.010542  0.004339  0.005040
2020-05-15 -0.005912  0.000257  0.014568  0.012580
2020-05-18  0.023561  0.039152  0.009554  0.007828
2020-05-19 -0.005778 -0.010447 -0.006922 -0.007554

In [9]:
returns['MSFT'].corr(returns['IBM'])

0.5998346705615225

In [10]:
returns['MSFT'].cov(returns['IBM'])

0.00016268308613483643

In [11]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.533933  0.711202  0.642543
IBM   0.533933  1.000000  0.599835  0.529863
MSFT  0.711202  0.599835  1.000000  0.751400
GOOG  0.642543  0.529863  0.751400  1.000000

In [12]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000329  0.000152  0.000222  0.000199
IBM   0.000152  0.000248  0.000163  0.000143
MSFT  0.000222  0.000163  0.000296  0.000222
GOOG  0.000199  0.000143  0.000222  0.000293

In [13]:
returns['MSFT'].cov(returns['MSFT'])

0.00029641273037072643

In [30]:
msft_limited = returns['MSFT'][1:4]
msft_limited

Date
2015-05-26   -0.006610
2015-05-27    0.021893
2015-05-28   -0.003361
Name: MSFT, dtype: float64

In [31]:
msft_limited.cov(msft_limited)

0.0002434484352594687

In [32]:
msft_limited.corr(msft_limited)

1.0